//TS6061C JOB 'COMPILE',CLASS=A,MSGCLASS=X,NOTIFY=TS6061,REGION=0M
//*
//*****************************************
//*  BATCH COBOL COMPILE
//*****************************************
//*  COBVER   V6R3
//*  COBPARM
//*  LPARM
//*****************************************
//*
//MYLIB JCLLIB ORDER=MFI01.COB.PROCLIB
//*
//PROG1 EXEC BATCHCL,MEM=EXAMPLE
//*
