//MFIMTRAL JOB (0),'ALLOCATE',MSGCLASS=X,CLASS=A,
//    NOTIFY=MFIMTR
//*
//* ALLOCATE A LOAD LIBRARY
//*
//* CHANGE MFIMTR TO YOUR MAINFRAME USERID
//* CHANGE EXAMPLE TO YOUR DATASET GROUP IDENTIFIER
//*
//DELETE  EXEC PGM=IEFBR14
//DD1     DD   DSN=MFIMTR.EXAMPLE.LOADLIB,DISP=(MOD,DELETE,DELETE),
//        SPACE=(TRK,(0,0,0))
//*
//CREATE  EXEC PGM=IEFBR14
//DD1     DD   DSN=MFIMTR.EXAMPLE.LOADLIB,DISP=(NEW,CATLG,DELETE),
//        SPACE=(CYL,(2,1,40)),
//        RECFM=U,DSORG=PO,BLKSIZE=32760,DSNTYPE=LIBRARY
