//MFIMTRCC JOB (0),'COMPILE',CLASS=A,MSGCLASS=X,
//  NOTIFY=MFIMTR
//*
//* COMPILE AND LINK COBOL SOURCE
//*
//* CHANGE MFIMTR TO YOUR MAINFRAME USERID
//* CHANGE EXAMPLE TO YOUR DATASET GROUP ID
//* CHANGE EXAMPLE TO THE YOUR COBOL SOURCE NAME
//*
//       JCLLIB ORDER=MFIMTR.EXAMPLE.PROCLIB
//COMPILE EXEC COBCL,CLASS='*',
//             SOURCE=MFIMTR.EXAMPLE.COBOL(EXAMPLE),
//             MODLIB=MFIMTR.EXAMPLE.LOADLIB,
//             SLIB1=MFIMTR.EXAMPLE.COPYLIB,
//             LIB1=MFIMTR.EXAMPLE.LOADLIB
//LKED.SYSIN  DD *
  NAME EXAMPLE(R)
/*
