//COBCL   PROC CLASS=*,
//             SOURCE=,
//             SLIB1='NULLFILE',
//             LIB1='NULLFILE',
//             MODLIB=
//COB     EXEC PGM=IGYCRCTL,REGION=0M,
//             PARM='XREF,MAP,LIST,DATA(24),RMODE(ANY)'
//STEPLIB  DD  DISP=SHR,DSN=IGY.V6R4M0.SIGYCOMP
//         DD  DISP=SHR,DSN=CEE.SCEERUN
//         DD  DISP=SHR,DSN=CEE.SCEERUN2
//SYSPRINT DD  SYSOUT=&CLASS
//SYSUT1   DD  UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT2   DD  UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT3   DD  UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT4   DD  UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT5   DD  UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT6   DD  UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT7   DD  UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT8   DD  UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT9   DD  UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT10  DD  UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT11  DD  UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT12  DD  UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSUT13  DD  UNIT=SYSDA,SPACE=(CYL,(2,1))
//SYSLIN   DD  DSN=&&LOADSET,UNIT=SYSDA,DISP=(MOD,PASS)
//SYSMDECK DD  DSN=&&SYSMDEK,UNIT=SYSDA,DISP=(MOD,PASS)
//SYSLIB   DD  DSN=IGY.V6R4M0.SIGYCOMP,DISP=SHR
//         DD  DSN=&SLIB1,DISP=SHR
//SYSIN    DD  DSN=&SOURCE,DISP=SHR
//*
//LKED    EXEC PGM=HEWL,REGION=0M,COND=(5,LT,COB),
//             PARM='LIST,MAP'
//SYSLIB   DD  DSN=CEE.SCEELKED,DISP=SHR
//         DD  DSN=&LIB1,DISP=SHR
//SYSLIN   DD  DSN=&&LOADSET,DISP=(OLD,DELETE)
//         DD  DDNAME=SYSIN
//SYSLMOD  DD  DSN=&MODLIB,DISP=SHR
//SYSUT1   DD  UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSPRINT DD  SYSOUT=&CLASS
//SYSIN    DD  DUMMY
