       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXAMPLE.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           COPY EXAMPLE.
       LINKAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO PRINTING WORLD' UPON SYSLST.
           DISPLAY 'HELLO CONSOLE WORLD' UPON CONSOLE.
           STOP RUN.
