//MFIMTRRJ JOB (0),'RUN EXAMPLE',MSGCLASS=X,CLASS=A,
//    NOTIFY=MFIMTR
//*
//* RUN EXAMPLE PROGRAM
//*
//* CHANGE MFIMTR TO YOUR MAINFRAME USERID
//* CHANGE EXAMPLE TO YOUR DATASET GROUP IDENTIFIER
//*
//EXAMPLE  EXEC PGM=EXAMPLE
//STEPLIB  DD   DSN=MFIMTR.EXAMPLE.LOADLIB,DISP=SHR
//SYSPRINT DD   SYSOUT=*