//DUMMY001 JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//*--------------------------------------------------------------------
//*        Dummy Job                        
//*--------------------------------------------------------------------
//STEP1    EXEC PGM=IEFBR14 