//FILELOCK JOB 'DEL CATALOG',CLASS=A 
//*
//* DELETE FILE
//*
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  DELETE  MFMIT.FILE001.BASE CLUSTER PURGE 
  SET MAXCC=0
/*
//*
//* DEFINE THE BASE CLUSTER
//*
//STEP2 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  DEFINE CLUSTER ( NAME (MFMIT.FILE001.BASE) -
                   RECORDSIZE(1047 1047) -
                   INDEXED KEYS (33 0) -
                   SHR (2) SPEED -
                   BUFSP(10240) -
                   REC (1047 1047) FSPC(5 1))-
            DATA  (NAME(MFMIT.FILE001.BASE.DATA) CISZ(4096)) -
            INDEX (NAME(MFMIT.FILE001.BASE.INDEX) CISZ(2048))
/*
//STEP2 EXEC PGM=MFWAIT
//SYSOUT  DD SYSOUT=*
//FILE001 DD DSN=MFMIT.FILE001.BASE,DISP=OLD
//