       IDENTIFICATION DIVISION.
       PROGRAM-ID.         MFWAIT.
       AUTHOR.  MIT. 
      * cobol MFWAIT.cbl noobj;
      * cob MFWAIT.cbl  
          
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.   

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.    

       DATA DIVISION.
       FILE SECTION.   

       WORKING-STORAGE SECTION.
       01 WS-MINUTES			PIC 9(4) VALUE 5.
       01 WS-MILLISECONDS		PIC 9(7) VALUE ZERO.
       
       LINKAGE SECTION. 

       PROCEDURE DIVISION.
     	   MULTIPLY WS-MINUTES BY 100 GIVING WS-MILLISECONDS
           CALL "CBL_THREAD_SLEEP" USING WS-MILLISECONDS
           GOBACK.