//LONGJOB JOB CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//*--------------------------------------------------------------------
//*        Execute COBOL Program                         
//*--------------------------------------------------------------------
//STEP1    EXEC PGM=MFWAIT  
//SYSPRINT DD SYSOUT=*
//*