//ECIJCL JOB (XXX,090074,XXXXX),'START CICS TRAN',
//         MSGCLASS=D,
//         MSGLEVEL=(1,1),
//         REGION=0M,
//         CLASS=A
//*====================================================================
//STEP0010 EXEC PGM=ECIJCL
//SYSABOUT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//*====================================================================
//